package mate.lesson.pecs.initialization;

public class Main {
    public static void main(String[] args) {
        Truck truck = new Truck("red", 100);
        System.out.println(truck);

        //  Порядок ініціалізації класів?
        // статичні поля батька/наслідника
        // звичайні поля батька/наслідника
        // конструктори батька/наслідника

        // 1 - статика батька
        // 2 - статика наслідника
        // 3 - звичайних полів батька
        // 4 - констурктор батька
        // 5 - звичайних полів наслідника
        // 6 - констурктор наслідника

    }
}
